/*
Назначить стипендии студентам по результатам сессии, используя следующие правила:
а) если все оценки 5 баллов, назначается повышенная стипендия;
б) если оценки 4 и 5 баллов, назначается обычная стипендия;
в) если есть оценка 3 балла, стипендия не назначается.
В результате должны быть напечатаны список группы с оценкамии и средним баллом каждого студента 
и два списка студентов, которым назначены повышенная и обычная стипендии.
*/


#include <string>
#include <iostream>
using namespace std;
 
int main()
{

    return 0;
}
