/*
В аптечном складе хранятся лекарства. В специальной ведомости содержатся сведения о лекарствах: наименование препарата, его количество, цена и допустимый срок хранения в месяцах.
Определить, сколько стоят самый дорогой и самый дешевый препараты; сколько наименований препаратов хранится на складе, какой препарат имеет срок хранения более трех месяцев и сколько стоят все препараты, хранящиеся на складе.
*/


#include <string>
#include <iostream>
using namespace std;
 
int main()
{

    return 0;
}
