/*
    Дан числовой ряд и некоторое число e . Найти сумму тех чле­нов ряда, модуль которых больше или равен заданному числу е,
если общий член этого ряда имеет следующий вид: см. рис. 06_03.png или an=(2n-1)/(2^n)

Решение оформить в виде функции iter_cycle, принимающей на вход вещественное число e и возвращающей сумму членов ряда

double iter_cycle(double e)
{
    double S = 0;
    //...
    return S;
}

*/

#include<iostream>
#include<cmath>
#include<stdio.h>
using namespace std;


//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++


int main()
{
    
}
