/*
Создать программу для "переворота" заданного целого числа.
Решение оформить в виде функции coup_number.  
Функция принимает в качестве аргумента целое число (number), а возвращает "перевернутое" исходное число.

int coup_number(int number)
{
        int result=0;
        //...
        return result;
}

Решение:
Количество разрядов числа заранее неизвестно. Поэтому для числа необходимо находить остаток от деления на 10, чтобы получить последнюю цифру числа. Эту цифру необходимо добавлять  к новому числу, сдвинув разряды (умножить на 10 и добавить остаток), а исходное переопределить путем деления на 10.
*/


int coup_number(int number)
{
        int result=0; 
        //...
        return result;
}

int main()
{
	//... 
	return 0;
}
