/*
    1) Составить программу вычисления КОЛИЧЕСТВА делителей при разложении натурального числа n на простые множители.

    Решение оформить в виде функции count_divider. Функция принимает в качестве аргумента целое число и 
    возвращает КОЛИЧЕСТВО простых делитей
    
    #include <string>
    int count_divider(int number)
    {
        int result=0;
        //...
        return result;
    }

    2) (ДОПОЛНИТЕЛЬНО)
    На промежутке от 0 до 9999 найти число с МАКСИМАЛЬНЫМ количеством делителей
    Решение оформить в виде функции max_count_divider. 
    Функция принимает в качестве аргумента целое число и возвращает ЧИСЛО С МАКСИМАЛЬНЫМ КОЛИЧЕСТВОМ простых делитей

    3) (ДОПОЛНИТЕЛЬНО)
        На промежутке от 0 до 9999 найти число с МАКСИМАЛЬНЫМ количеством неповторяющихся делителей
*/

#include<iostream>
#include<cmath>
#include<stdio.h>
#include<string> //библиотека работы со строками
using namespace std;

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//Число с максимальным количеством делителей
int count_divider(int number)
{
    
}

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//Разложение числа на множители
int max_count_divider(int beg, int end)
{
   
}
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

int main()
{
    
}
