/*
Задача:
Составить программу нахождения точек пересечения графиков функций a1*x+b1*y+c1 =0 и a2*x+b2*y+c2 
Вычисление координат точек должно быть описано в функциях intersect_koord_x, intersect_koord_y

Спецификация функций:
intersect_koord_ y:
Назначение - вычисление координаты Y точки пересечения графиков линейных функций
Вход - вещественные коэффициенты графиков функций (double a1,double b1,double c1,double a2,double b2,double c2)
Выход - вещественное значение координаты Y
Примечание: полученное значение подается на вход функции intersect_koord_ x

intersect_koord_ x:
Назначение - вычисление координаты X точки пересечения графиков линейных функций
Вход - вещественные коэффициенты графиков функций (double a1,double b1,double c1,double y)
Выход - вещественное значение координаты X

*/