/*
Задача:
Найти произведение цифр заданного четырехзначного числа.
Вычисление результата должно быть выполнено в функции calc_number

Спецификация функции calc_number:
-------------------------------------
Аргументы (вход): целое четырехзначное число (x)
Выход: произведение цифр числа
Пояснения: Для получения последней цифры получать остаток от деления числа на 10, после этого число переопределить путем получения целой части от деления на 10
--------------------------------------
*/


#include<iostream>
using namespace std;
//...

double calc_number(int x)
{
  	
} 

int main()
{
  
  return 0;
}
