/*
Задача:
Составить программу вычисления корней квадратного уравнения ax^2+bx+c=0
Решение должно содержать 3 функции: discr,root_x1,root_x2

Спецификация функций:
discr:
Назначение - вычисление дискриминанта
Вход - вещественные коэффициенты квадратного уравнения (double a,double b,double c)
Выход - вещественное значение дискриминанта

root_x1:
Назначение - вычисление первого (единственного) корня
Вход - вещественные коэффициенты квадратного уравнения и дискриминант (double a,double b,double d)
Выход - вещественное значение первого (единственного) корня

root_x2:
Назначение - вычисление второго корня
Вход - вещественные коэффициенты квадратного уравнения и дискриминант (double a,double b,double d)
Выход - вещественное значение второго корня

*/