/*
Задача:
Дана длина ребра куба. Найти площади грани, полной поверхности и объем этого куба.
Вычисления должны быть выполнены в функциях:
грань - cub_edge
поверхность - cub_surf
объем - cub_vol

Спецификация функций:
---------------------------
* Аргументы (вход): целочисленное значения длины ребра куба l
* Выход: вещественное число  (double)
* Пояснения: 
-------------------------------------------
*/

#include<iostream>
//...

double cub_edge(int l)
{
  return result;
} 

double cub_surf(int l)
{
  return result;
} 

double cub_vol(int l)
{
  return result;
} 

int main()
{
  return 0;
}
