/*
Задача:
Вычислить расстояние между двумя точками с заданными координатами (x1,y1) и (х2, у2).
Вычисление результата должно быть выполнено в функции point_distance

Спецификация функции point_dist:
---------------------------------------
* Аргументы (вход): целочисленные значения координат точек x1, y1, x2, y2
* Выход: вещественное число  (double)
* Пояснения: используется теорема Пифагора
------------------------------------------------
*/

#include<iostream>
//#include...

double point_dist(int x1,int y1, int x2, int y2)
{
  return result;
} 

int main()
{
  return 0;
}
