/*
    Каждый солнечный день улитка, сидящая на дереве, подни­мается вверх на 2 см, а каждый пасмурный день опускается вниз на 1 см. 
    В начале наблюдения улитка находилась в А см от земли на B-метровом дереве. Массив данных из 30 элементов содержит сведения о том, 
    был ли соответствующий день наблюдения пас­мурным или солнечным. 
    Определить местоположение улитки кконцу 30-го дня наблюдения.
*/

#include<iostream>
#include<ctime>
#include<cmath>
using namespace std;

int main()
{
    return 0;
}