/*
Составить программы, печатающие значение True, если следующие указанные высказывания являются истинными, и значение False — в противном случае.

Координаты левой верхней и правой нижней вершин прямоугольника (x1, y1) и (х2, у2). Точка А(х,у) принадлежит прямоугольнику.
Процесс организовать с помощью функции check_point(int x1,int y1,int x2,int y2, int x, int y)
Функция принимает координаты вершин прямоугольника и точки, и возвращает 1 если точка принадлежит прямоугольнику, 0 - в противном случае
*/
