/*
Дана строка, заканчивающаяся точкой. Определить, сколько слов в строке.
Количество слов в строке должно возвращаеться функцией count_words
*/
#include <string>
#include <iostream>
#include <ctime>
using namespace std;

int count_words(string line)
{
   
    return result;
} 

int main()
{
    string s1;
    int cw = 0;
    cout<<"введите строку"<<"\n";
    getline(cin,s1);
    cout<<"Кол-во слов в строке = "<<count_words(s1)<<endl;;
    return 0;
}