/*
Дана символьная строка, представляющая собой запись натурального числа в p-ричной системе счисления (2 < р < 9). 
Перевести это число в десятичную систему счисления.
Перевод выполнять с помощью функции change_num(string num, int p,int d)

Спецификация функции:
-----------------------
* Вход - исходное число в виде строки, исходная система счисления, длина строким(string num, int p,int d)
* Выход - целое число в десятичной системе счисления

*/
#include<string>
using namespace std;

int change_num(string num, int p,int d)
{
    int result = 0;
    return result;
}