/*
Имеется часть катушки с автобусными билетами. Номер билета шестизначный. Определить количество счастливых билетов на катушке, если меньший номер билета — N, а больший — М.
(Билет является счастливым, если сумма трех первых его цифр равна сумме трех последних цифр.)
Процесс организовать с использованием функции happy_ticket

Спецификация функции happy_ticket
---------------------------------
* Вход - целочисленные значения наименьшего и наибольшего номеров на катушке - (int N, int M) 
* Выход - количество счастливых билетов на катушке 

*/

int happy_ticket(int N, int M)
{
	int result;
	//...
	return result;
}


