/*
Вычислить площадь правильного шестиугольника со стороной а, используя подпрограмму вычисления площади треугольника.
Решение выполнить с использованием функции square_triangle(int a)
Спецификация:
-------------
* Назначение - вычисление площади правильного теугольника
* Вход - целочисленное значение стороны a
* Выход - вещественное значение площади треугольника, c округлением до 3 знаков после запятой

S = int(S*1000)/1000.0; //округление до 3 знаков после запятой

double square_triangle(int a)
{
	//...
}

*/


double square_triangle(int a)
{
         double result = 0;
        //...
        return int(result*1000)/1000.0;
}


