/*
Ежемесячная стипендия студента составляет сумму А рублей, а расходы на проживание превышают стипендию и составляют сумму В рублей в месяц. 
Рост цен ежемесячно увеличивает расходы на 3 %. 
Рассчитать сумму, которую следует единовременно попросить у родителей, чтобы прожить учебный год (10 месяцев), используя только эти деньги и стипендию.
Процесс организовать с помощью функции func_summ(int A, int B)
Функция func_summ принимает в качестве аргументов стипендию и расходы и возвращает сумму, которую необходимо попросить у родителей
*/
