/*
На плоскости n точек заданы своими координатами, а также задана окружность с радиусом R и с центром в начале координат.
Указать множество всех треугольников (координаты их вершин), содержащихся внутри окружности.
Примечание:
Координаты точки указываются в разных массивах. Например P0(5,3)  Koor_X[0]=5, Koor_Y[0]=3
Спецификация функции:
Вход - ссылки на целочисленные массивы координат точек(Koor_X,Koor_Y), длина массива(len), радиус окружности(R)
Выход - функция не возвращает значение (void), а выводит на экран координаты точек(вершины искомых трегольников) 
*/

void set_triangle(int *Koor_X,int *Koor_Y,int len,int R)
{ 
	//... 
}

int main()
{
	
}
