/*
Входные данные — возраст n человек. Определить количество человек, возраст которых находится в интервале 10 лет, т.е. 0...9 лет, 10...19 лет, 20...29 лет и т.д. Напечатать результаты расчетов в удобочитаемой форме.
Массив заполнить random числами из промежутка [0,99]
Для каждой группы расчет выполнить в функции: CountAge
Спецификация функции:
Вход - ссылка на массив с возрастом (*A), длина массива(len),нижняя граница возраста (a), верхняя граница возраста(b)
Выход - количество человек в возрастной группе
*/

int CountAge(int *A,int len,int a,int b)
{ 
	//... 
}

int main()
{
	
}
