/*

У прилавка магазина выстроилась очередь из n покупателей.
Время обслуживания i-го покупателя равно Ti, (где i = 1,..., n). 
Определить время Ci пребывания i-ro покупателя в очереди.
Расчет выполнить с помощью функции calc_time(см.листинг ниже)
Массив заполнить датчиком случайных чисел значениями из промежутка [60;150]
Спецификация функции:
Вход - ссылка на целочисленный массив(*A), длина массива(len), номер покупателя(cust)
Выход - искомое время
*/

int calc_time(int *A,int len,int cust)
{
	double result; 
	//...
}

int main()
{
	
}
