/*
Задача:
В небоскребе N этажей и всего один подъезд. На каждом этаже по три квартиры. 
Лифт может останавливаться только на нечетных этажах. 
Человек входит в кабину лифта и набирает номер необходимой ему квартиры М. 
Определить, на какой этаж лифт должен доставить пассажира? 
Процесс организовать с использованием функции find_floor. Функция должна вернуть номер этажа

Тесты:
1.N=5, M=11  2. N=4,  M=11  3. N=7, M=15   4. N=7, M=69
*/

//Листинг ex_04_05.cpp

#include<iostream>
#include<cmath>

using namespace std;

//Функция вычисления номера этажа для остановки лифта (find_floor )
//аргументы: m - номер квартиры (целое число)
int find_floor(int m)
{
	
}

// Основная программа
int main()
{
  return 0;
}
