/*
Определить, пройдет ли график функции y=ax^2 + bx + c через заданную точку с координатами (m,n).
Процесс организовать с использованием функции check_point. 
Функция должна вернуть 1 если точка принадлежит графику, 0 - в противном случае
*/

#include<iostream>
#include<cmath>

using namespace std;

int check_point(float a, float b, float c, int x, int y)
{
  cout<<"Attention!!! check_point is working"<<endl;
  int result=0;
  //...
  
  return result;
}

int main()
{
 //...
  

}
