/*
Два прямоугольника, расположенные в первом квадранте, со сторонами, параллельными осям координат, заданы координатами своих левого верхнего и правого нижнего углов. 
Для первого прямоугольника это точки с координатами (х1,y1) и (х2, 0), для второго — (х3, у3), (х4, 0). 
Определить, пересекаются ли данные прямоугольники, и вычислить площадь их общей части, если они пересекаются.
Функция isect_rect должна вернуть площадь общей части или 0, если прямоугольники не пересекаются.

Тесты:
1. x1 = 0, y1 = 5, x2=5, y2=0, x3 = 2, y3 = 2, x4=7, y4=0
2. x1 = 0, y1 = 5, x2=7, y2=0, x3 = 1, y3 = 2, x4=5, y4=0 
3. x1 = 2, y1 = 5, x2=7, y2=0, x3 = 0, y3 = 2, x4=5, y4=0 
4. x1 = 0, y1 = 5, x2=3, y2=0, x3 = 4, y3 = 2, x4=7, y4=0 

*/
#include<iostream>

using namespace std;

float isect_rect(int x1,int y1,int x2,int y2,int x3,int y3,int x4,int y4)
{
  float result = 0;
  return result;
}

int main()
{
  //Описание переменных
  //...
  
  //Запрос и считывание данных
  //...

  //Вычисление площади
  //...

}

