/*
Пусть элементами прямоугольного равнобедренного треугольника являются: 1 — катет а; 2 — гипотенуза b; 3 — высота,опущенная из вершины прямого угла на гипотенузу h; 
4 — площадь S. По заданным номеру и значению соответствующего элемента вычислить значения всех остальных элементов треугольника. 
*/

#include<iostream>
#include<cmath>

using namespace std;

//вычисление гипотенузы по известному катету
float gipotenuza(float katet)
{
    float g=0;
    //... 
    return g; 
}

//вычисление площади по известному катету
float squa(float katet)
{
   
}



int main ()
{
    return 0;
}